{
  "development-tools": "Tools in Data Science\nTools in Data Science\n1. Development Tools\nEditor: VS Code\nAI Code Editors: GitHub Copilot\nPython tools: uv\nJavaScript tools: npx\nUnicode\nBrowser: DevTools\nCSS Selectors\nJSON\nTerminal: Bash\nAI Terminal Tools: llm\nSpreadsheet: Excel, Google Sheets\nDatabase: SQLite\nVersion Control: Git, GitHub\n2. Deployment Tools\n3. Large Language Models\nProject 1\n4. Data Sourcing\n5. Data Preparation\n6. Data Analysis\nProject 2\n7. Data Visualization\nDevelopment Tools\n\nNOTE: The tools in this module are PRE-REQUISITES for the course. You would have used most of these before. If most of this is new to you, please take this course later.\n\nSome tools are fundamental to data science because they are industry standards and widely used by data science professionals. Mastering these tools will align you with current best practices and making you more adaptable in a fast-evolving industry.\n\nThe tools we cover here are not just popular, they’re the core technology behind most of today’s data science and software development.\n\n Previous\nTools in Data Science\nNext \nEditor: VS Code",
  "vscode": "Tools in Data Science\nTools in Data Science\n1. Development Tools\nEditor: VS Code\nEditor: VS Code\nAI Code Editors: GitHub Copilot\nPython tools: uv\nJavaScript tools: npx\nUnicode\nBrowser: DevTools\nCSS Selectors\nJSON\nTerminal: Bash\nAI Terminal Tools: llm\nSpreadsheet: Excel, Google Sheets\nDatabase: SQLite\nVersion Control: Git, GitHub\n2. Deployment Tools\n3. Large Language Models\nProject 1\n4. Data Sourcing\n5. Data Preparation\n6. Data Analysis\nProject 2\n7. Data Visualization\nEditor: VS Code\n\nYour editor is the most important tool in your arsenal. That’s where you’ll spend most of your time. Make sure you’re comfortable with it.\n\nVisual Studio Code is, by far, the most popular code editor today. According to the 2024 StackOverflow Survey almost 75% of developers use it. We recommend you learn it well. Even if you use another editor, you’ll be working with others who use it, and it’s a good idea to have some exposure.\n\nWatch these introductory videos (35 min) from the Visual Studio Docs to get started:\n\nGetting Started: Set up and learn the basics of Visual Studio Code. (7 min)\nCode Editing: Learn how to edit and run code in VS Code. (3 min)\nProductivity Tips: Become a VS Code power user with these productivity tips. (4 min)\nPersonalize: Personalize VS Code to make it yours with themes. (2 min)\nExtensions: Add features, themes, and more to VS Code with extensions! (4 min)\nDebugging: Get started with debugging in VS Code. (6 min)\nVersion Control: Learn how to use Git version control in VS Code. (3 min)\nCustomize: Learn how to customize your settings and keyboard shortcuts in VS Code. (6 min)\n Previous\n1. Development Tools\nNext \nAI Code Editors: GitHub Copilot",
  "github-copilot": "Tools in Data Science\nTools in Data Science\n1. Development Tools\nEditor: VS Code\nAI Code Editors: GitHub Copilot\nAI Editor: GitHub Copilot\nPython tools: uv\nJavaScript tools: npx\nUnicode\nBrowser: DevTools\nCSS Selectors\nJSON\nTerminal: Bash\nAI Terminal Tools: llm\nSpreadsheet: Excel, Google Sheets\nDatabase: SQLite\nVersion Control: Git, GitHub\n2. Deployment Tools\n3. Large Language Models\nProject 1\n4. Data Sourcing\n5. Data Preparation\n6. Data Analysis\nProject 2\n7. Data Visualization\nAI Editor: GitHub Copilot\n\nAI Code Editors like GitHub Copilot, Cursor, Windsurf, Roo Code, Cline, Continue.dev, etc. use LLMs to help you write code faster.\n\nMost are built on top of VS Code. These are now a standard tool in every developer’s toolkit.\n\nGitHub Copilot is free (as of May 2025) for 2,000 completions and 50 chats.\n\nYou should learn about:\n\nCode Suggestions, which is a basic feature.\nUsing Chat, which lets you code in natural language.\nChanging the chat model. The free version includes Claude 3.5 Sonnet, a good coding model.\nPrompts to understand how people use AI code editors.\n Previous\nEditor: VS Code\nNext \nPython tools: uv"
}